{
    "identity": "pex-1687",
    "title": "<p>Analysis plan for primary cohort GWAS for blood lipid levels for the Global Lipids Genetics Consortium</p>",
    "content": [
        {
            "header": "Introduction",
            "content": ""
        },
        {
            "header": "Reagents",
            "content": ""
        },
        {
            "header": "Equipment",
            "content": ""
        },
        {
            "header": "Procedure",
            "content": "<p><strong>Global Lipids Genetics/GIANT Consortium HRC and 1KG phase3 Imputation and Analysis plan version 2</strong></p><p>Updated: April 27, 2017 (v2a) to include non-HDL-cholesterol and some minor tweaks but analysis results generated using the March 17, 2017 plan (v2) are also acceptable.&nbsp;All changes since March 17, 2017 are highlighted in yellow.</p><p><strong>&nbsp;</strong></p><p>Plan originally drafted by Xueling Sim, Heather Highland, and Scott Vrieze, modified by GIANT 1KG/HRC working group and Global Lipids Genetics Consortium HRC imputation working group, including Adam Locke and Sailaja Vedantam. If you have questions, please reply to the group CCed on the email accompanying this plan.</p><p>&nbsp;</p><p><strong>Overview </strong></p><p>There are three major components to this analysis plan:</p><p>1)&nbsp;&nbsp;&nbsp;&nbsp;Genome-wide genotypes must be on the correct build (37/hg19) and correct strand (forward).</p><p>2)&nbsp;&nbsp;&nbsp;&nbsp;For ALL studies, imputation of genotypes is performed using the 1KG phase 3 (if you have not already done so) and, for studies with samples of European-ancestry, also to the large haplotype panel from the Haplotype Reference Consortium. If you have already imputed to a different large haplotype panel (e.g. UK10K) please contact us.</p><p>3)&nbsp;&nbsp;&nbsp;&nbsp;Association analysis is conducted using specific software tools that will provide all necessary summary statistics for flexible central meta-analysis.</p><p>&nbsp;</p><p>This coordinated plan between Global Lipids and GIANT is meant to reduce the burden on primary analysts. We welcome you to join one or both consortia.&nbsp;We thank you for your participation in past projects, and particularly welcome studies that are new to either consortia.</p><p>&nbsp;</p><p>Software</p><p>Below is a list of the software you will need to complete this analysis plan. For some tools using the specific version listed may be important.</p><p>&nbsp;</p><p>Phasing algorithms such as SHAPEIT, Eagle, HapiUR, and Minimac are only necessary if you’re conducting imputation in-house, rather than using an imputation server. We provide generic instructions and instructions specific for the University of Michigan imputation server. Some may have used or be using other servers (e.g. the Sanger server); please contact them for instructions specific to that imputation server.</p><p>&nbsp;</p><p>rvTests (20170210): <a href=\"https://github.com/zhanxw/rvtests\" rel=\"noopener noreferrer\" target=\"_blank\">https://github.com/zhanxw/rvtests</a>/releases</p><p>BGZIP and tabix (0.2.6): <a href=\"http://samtools.sourceforge.net/tabix.shtml\" rel=\"noopener noreferrer\" target=\"_blank\">http://samtools.sourceforge.net/tabix.shtml</a></p><p>Bcftools (1.3.1): http://www.htslib.org/download</p><p>Vcftools (0.1.8): <a href=\"https://github.com/vcftools/vcftools\" rel=\"noopener noreferrer\" target=\"_blank\">https://github.com/vcftools/vcftools</a></p><p>PLINK1.9 (Plink2): <a href=\"https://www.cog-genomics.org/plink2\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.cog-genomics.org/plink2</a></p><p>&nbsp;</p><p>1. Genotypes</p><p><strong><u>Array</u></strong></p><p>All studies must have some version of a genome-wide array, for example with &gt;200,000 genome-wide common variants. Targeted arrays with limited/incomplete coverage of the genome (e.g. MetaboChip, ImmunoChip, Exome Chip, etc.) should not be used unless merged with a genome-wide array. If you are unsure, please contact Joel and/or Cristen for specific advice.</p><p>&nbsp;</p><p>Individual studies should provide information in the Excel spreadsheet about the manufacturer and version of the array(s) they are using.</p><p>&nbsp;</p><p>QC should be done separately for individual studies, for major continental ancestries within a study, and also separately for samples of the same study that were genotyped on different arrays.</p><p>&nbsp;</p><p><strong><u>Genotype QC </u></strong></p><p>Typical pre-imputation QC criteria:</p><p>These are some steps that we recommend for sample QC. Additional QC steps may be needed and should be determined by the local analysts for each study. Studies should provide a brief description of QC criteria in the Excel sheet.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Sample call rate (cut off &gt;95% threshold recommended)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Exclude samples with heterozygosity &gt; median + 3*IQR</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Remove gender mismatches</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Remove duplicates</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Remove PCA outliers using a PCA projection of the study samples onto 1KG reference samples.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Hardy-Weinberg p&gt;10<sup>-6</sup>, SNP call rate ≥98%</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Remove monomorphic markers</p><p>&nbsp;</p><p>Additional QC will be conducted centrally at the meta-analysis stage.</p><p>&nbsp;</p><p><br></p><p><strong><u>&nbsp;</u></strong></p><p><strong><u>Prepare files for imputation </u></strong></p><p>The “HRC/1KG Imputation Preparation and Checking Tool” developed by Will Rayner will check input data for accuracy relative to expected HRC or 1000G inputs prior to imputation.</p><p>&nbsp;</p><p>This process will identify errors in your input data, including incorrect REF/ALT designations, incorrect strand designations, extreme deviations from expected allele frequencies, and palindromic (A/T and G/C) SNPs with allele frequency near 0.5 that are often the source of imputation errors, and generates commands to make files that have fixed or removed these problematic variants.</p><p>&nbsp;</p><p>The tool can be downloaded here: <a href=\"http://www.well.ox.ac.uk/~wrayner/tools/HRC-1000G-check-bim.v4.2.5.zip\" rel=\"noopener noreferrer\" target=\"_blank\">http://www.well.ox.ac.uk/~wrayner/tools/HRC-1000G-check-bim.v4.2.5.zip</a></p><p><u>&nbsp;</u></p><p>The tool requires site lists from the reference panels for comparison, which are available for download at the following locations:</p><p>HRC: <a href=\"about:blank\" rel=\"noopener noreferrer\" target=\"_blank\">ftp://ngs.sanger.ac.uk/production/hrc/HRC.r1-1/HRC.r1-1.GRCh37.wgs.mac5.sites.tab.gz</a> (then unzipped with gunzip)</p><p>1000G Phase 3: <a href=\"http://www.well.ox.ac.uk/~wrayner/tools/1000GP_Phase3_combined.legend.gz\" rel=\"noopener noreferrer\" target=\"_blank\">http://www.well.ox.ac.uk/~wrayner/tools/1000GP_Phase3_combined.legend.gz</a> (then unzipped with gunzip)</p><p>The tool also requires frequency files from plink, which can be created as follows:</p><p><em>plink --bfile &lt;binary plink prefix&gt; --freq --out input_file_prefix</em></p><p>&nbsp;</p><p>With these input files the tool can be run as follows:</p><p>HRC: <em>perl HRC-1000G-check-bim.pl -b &lt;bim file&gt; -f &lt;frequency file&gt; -r HRC.r1-1.GRCh37.wgs.mac5.sites.tab –h</em></p><p>&nbsp;</p><p>1000G: <em>perl HRC-1000G-check-bim.pl -b &lt;bim file&gt; -f &lt;frequency file&gt; -r 1000GP_Phase3_combined.legend -g -p &lt;population&gt;</em></p><p>&nbsp;</p><p>(ALL, EUR, AFR, AMR, SAS, EAS are the relevant options for the –p &lt;population&gt; parameter, with ALL as default)</p><p>&nbsp;</p><p>The perl script automatically produces a shell-script called <em>Run-plink.sh. </em>The shell script contains a set of plink commands that<em> </em>should be run to update or remove SNPs based on the checks and to create one updated binary plink file per chromosome. For this, the paths to the original study binary file should be adjusted in the shell script and the script should be started by typing ./<em>Run-plink.sh </em>at the command prompt.</p><p>&nbsp;</p><p>The cleaned/updated binary files (one for each chromosome) generated by this tool should be ready for upload to the imputation server below after changing them to VCF format using plink2, bgzip and tabix in the UNIX environment:</p><p><em>&nbsp;</em></p><p><em>for i in `seq 1 23`;&nbsp;</em></p><p><em>do </em></p><p><em>plink --bfile Study-updated-chr${i} --keep-allele-order --recode vcf-iid --out Study-updated-chr${i}</em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;bgzip Study-updated-chr${i}.vcf</em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;tabix –p vcf Study-updated-chr${i}.vcf.gz</em></p><p><em>done</em></p><p><strong>&nbsp;</strong></p><p><strong>2. Imputation</strong></p><p>There are two ways to conduct imputation: a) an Imputation Server or b) in-house imputation. The following instructions provide detailed instructions for imputation with the Michigan Imputation Server, but others such as the Sanger server are also acceptable. We recommend you use an imputation server if possible.</p><p><strong>&nbsp;</strong></p><p><strong>Note</strong>: If you prefer, the imputation server has a ‘Quality Control only’ option you can use prior to imputation to ensure that no samples will be eliminated during imputation of autosomes or X chromosome.</p><p>&nbsp;</p><p>If you run ‘QC and imputation’, and samples are removed (e.g., due to gender discordance), please make sure that number and order of samples in the X chromosome and autosomes will match as described in section 2.3.</p><p><strong><u>&nbsp;</u></strong></p><p><strong><u>Ancestry of samples and imputation panels:</u></strong></p><p>We ask all studies that have not imputed to 1KG phase 3 to use the imputation server to do so. In addition, for studies with individuals of European-ancestry, we ask that they <strong>also</strong> use the imputation server to impute using the HRC panel.</p><p><strong><u>&nbsp;</u></strong></p><p><strong><u>Phasing</u></strong></p><p>The imputation server will automatically determine if you provide phased or unphased VCF files. We encourage re-phasing using Eagle (which is implemented by the imputation server). If you would like to provide phased haplotypes please convert them to VCF format.</p><p>An example command to convert haplotype format of HAPS/SAMPLE files from SHAPEIT to VCF would be:</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em>shapeit –convert –input-haps study.phased –output-vcf&nbsp;study-phased.vcf</em></p><p>&nbsp;</p><p><strong>2.1. Impute to 1KG phase 3 panel </strong></p><p>The 1KG phase 3 samples has both European and non-European samples and includes SNPs, indels, and CNVs. To capture these additional markers, and to provide a common reference panel across all samples, we ask that ALL studies, regardless of ancestry, impute to 1KG phase 3.</p><p>&nbsp;</p><p>Please upload VCF files (phased or non-phased). Then select the following options:</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Reference Panel: 1000G Phase3 v5</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Phasing: </strong>Eagle v2.3</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Population: </strong>as appropriate for the study (used only for quality control purposes)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Mode: </strong>Quality Control &amp; Imputation</p><p>Note: Chromosome X will need to be imputed separate from other chromosomes after reformatting plink code 23 to X in the VCF file. Currently, SHAPEIT is the only available method for phasing chrX.</p><p>See below for detailed instructions on using the imputation server.</p><p>&nbsp;</p><p>2.2. Impute to HRC reference panel</p><p>The Haplotype Reference Consortium (HRC) has assembled over 60,000 haplotypes by combining together sequencing data from multiple cohorts (http://www.haplotype-reference-consortium.org). Impute all individuals of European ancestry using the HRC panel.</p><p>&nbsp;</p><p>Please upload VCF files. Then select the following options:</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Reference Panel: </strong>HRC r1.1 2016</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Phasing: </strong>Eagle v2.3</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Population: </strong>EUR (this parameter is for quality control purposes)&nbsp;</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Mode: </strong>Quality Control &amp; Imputation</p><p>NOTE: Chromosome X will need to be imputed separately from other chromosomes after reformatting plink code 23 to X in the VCF file. Currently, SHAPEIT is the only available method for phasing chrX.</p><p><strong>&nbsp;</strong></p><p><strong><u>Using the imputation server</u></strong></p><p>The Michigan Imputation Server is available at <a href=\"https://imputationserver.sph.umich.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">https://imputationserver.sph.umich.edu</a>. The server uses standard encryption (SSL or SFTP) to help ensure that genotypes are encrypted during upload and download. It does a few things automatically:</p><p>1. Ensures we are all imputing to the exact same reference panel.</p><p>2. Automatically performs quality checks (alleles, MAFs, SNP names, etc.)</p><p>3. It phases and imputes, at no cost to the user in either computational time or analyst time.</p><p>&nbsp;</p><p><u>Uploading VCF files</u></p><p>Make an account and follow the instructions on the website. You will upload VCF genotype files to the server (only VCF file format is supported; instructions on converting to VCF are contained on the imputation server website under “Help” and above in the chapter “Prepare files for imputation”). <strong>One VCF file must be submitted for each chromosome. </strong></p><p>&nbsp;</p><p><u>Downloading your imputed genotypes, info files, and QC report</u></p><p>When imputation has finished you will receive an email alert. The imputation server will automatically encrypt all your imputed genotypes (for protection during download). The password to decrypt the files will be in the email notification, so don’t delete that email!</p><p>&nbsp;</p><p>When you download your imputed genotypes please be sure to download all available files (the qcreport, statistics, zip files, and all the log files). We will ask that you submit most of these files to us along with all other files generated as part of this analysis plan. <strong>Please do a quick check of the qcreport.html and statistics.txt files before proceeding with the analysis plan. If you are unsure of your imputation quality, please contact us. You will also upload these files to the server (see 8c).</strong></p><p>&nbsp;</p><p><u>X chromosome</u></p><p>NOTES on chromosome X:</p><p>1) If the server detects sex discrepancy between genotypes and the provided PED file, discordant samples will be removed automatically prior to phasing and imputation. You will need to resolve these discrepancies genome-wide before proceeding with analysis.</p><p>&nbsp;</p><p>2) You will receive two output VCF files for chromosome X, one for males and one for females. You will need to merge these into a single chrX VCF.</p><p>&nbsp;</p><p>Both of these issues are addressed below in section 2.3.</p><p><strong><u>&nbsp;</u></strong></p><p><strong><u>Imputation In-House</u></strong></p><p>If you have chosen to use an imputation server, then you can ignore this step.</p><p>Some studies will not be able to use the imputation server, for example if original participant consents forbid it. These studies will have to conduct imputation on their own. Please contact us if you need assistance.</p><p>&nbsp;</p><p><strong>2.3. Post-imputation sample harmonization and variant pruning </strong></p><p>There are a few post-imputation processing steps that are necessary prior to analysis.</p><p>&nbsp;</p><p><strong>A. Harmonize samples and samples order between autosomes and chromosome X </strong></p><p>As mentioned above, chrX imputation may have different numbers and order of samples from the autosomes due to automated filtering on the imputation server. You need to reconcile these possible discrepancies before creating a single whole genome VCF file, which will be used to create a genomic relationship matrix (kinship matrix) for the linear mixed model. If the sets of samples are not identical between the X and autosome VCFs (most likely because possibly sex-discordant samples were dropped during imputation of the X) you will need to eliminate any samples present only in autosome or X VCFs, and then reorder the samples in the X chromosome VCF file. The following bcftools commands 1) make a list of samples IDs in the chr22 VCF, 2) merges the male and female chrX VCFs and reorders the resulting chrX VCF according to the order of samples in chr22, then 3) generates an ordered list of IDs from chrX. Compare the two ID lists to confirm they are identical before proceeding.&nbsp;Note that some cohorts have a small number of males who are heterozygous at many X chromosome markers outside the pseudoautosomal region.&nbsp;Because these create problems later in analysis, we recommend removing these individuals as well, in addition to sex-discordant individuals.</p><p>&nbsp;</p><p>1)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em>bcftools query -l chr22.dose.vcf.gz &gt; ID_order_autosomes.txt</em></p><p>2)<em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;bcftools merge chrX.no.auto_male.dose.vcf.gz chrX.no.auto_female.vcf.gz –m both -O u | bcftools view -S ID_order_autosomes.txt --force-samples -O z &gt; ChrX.combined.reorder.vcf.gz</em></p><p>3)<em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;bcftools query –l chrX.combined.reorder.vcf.gz &gt; ID_order_chrX.txt</em></p><p><em>&nbsp;</em></p><p>If there are samples in the autosomal files that do not appear in the chrX imputed VCFs, then bcftools will report a warning message:</p><p>&nbsp;</p><p>Warn: subset called for sample that does not exist in header: [ID] … skipping</p><p>&nbsp;</p><p>It then proceeds to reorder the file, omitting these observations. If you encounter this message, you will need to use the sample list file ID_order_chrX.txt to select the overlapping samples when creating the polymorphic datasets in section B below.</p><p>&nbsp;</p><p>If you do <strong>NOT</strong> receive the warning message, please check that the sample list files ID_order_chrX.txt and ID_order_autosomes.txt are exactly the same (in content and order). If these two files are identical, you may proceed without the sample selection option in section B. This will speed up the operation of bcftools in section B.</p><p><strong>&nbsp;</strong></p><p><strong>B. Create a list of monomorphic sites and subset polymorphic variants</strong></p><p>These reference panels impute a great many variants into your samples, the vast majority of which are rare, and many will not be polymorphic in your sample. To minimize the size of output files in the association analyses below, we ask that you remove all monomorphic sites (monomorphic defined as at least one variant hard call genotype) from input VCF files prior to analysis. In conjunction, we ask that you upload a list of the variants that you drop in this process. The following commands with bcftools will generate both the list of monomorphic SNPs and the pruned VCF files.</p><p>&nbsp;</p><p>#Generate lists of monomorphic sites</p><p><em>#!/bin/bash</em></p><p><em>for i in `seq 1 22`;</em></p><p>&nbsp;<em>do</em></p><p><em>&nbsp;bcftools view -q1.0:major –S ID_order_chrX.txt chr${i}.dose.vcf.gz –O u | bcftools query -f '%CHROM\\t%POS\\t%REF,%ALT\\n' &gt;&gt; STUDY_PANEL_ANALYST_imputed.monomorphic.txt</em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;done</em></p><p><em>&nbsp;</em></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;#Generate VCFs with only polymorphic variants</p><p><em>#!/bin/bash</em></p><p><em>for i in `seq 1 22`;</em></p><p><em>do</em></p><p><em>&nbsp;bcftools view –c 1:minor –S ID_order_chrX.txt chr${i}.dose.vcf.gz&nbsp;-O z &gt; chr${i}.imputed.poly.vcf.gz</em></p><p><em>&nbsp;tabix -p vcf chr${i}.imputed.poly.vcf.gz</em></p><p><em>done</em></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;#Also run commands for merged chrX, which won’t follow the pattern for the loop.</p><p><em>&nbsp;</em></p><p><br></p><p><strong>&nbsp;</strong></p><p><strong>3. Phenotype definition, covariate adjustment, and trait transformation</strong></p><p>ALL TRAITS ARE INVERSE NORMAL TRANSFORMED AFTER CREATION OF RESIDUALS TO FACILITATE PROPER ANALYSIS OF LOW FREQUENCY VARIANTS</p><p>&nbsp;</p><p>The rank-based inverse normal transformation of the residuals can be performed as below; alternatively, rvtests can automatically perform inverse normalization for covariate-adjusted trait residuals (instructions for this are in section 4.D. under Genotype-Phenotype Associations).</p><p>in SAS:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em>proc rank data=mydata out=inv normal=blom var &amp;trait; </em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;run;</em></p><p><em>&nbsp;</em></p><p>in R:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em>#if you have missing data </em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;y &lt;- qnorm((rank(x,na.last=\"keep”)-0.5)/sum(!is.na(x))) </em></p><p>&nbsp;</p><p>in STATA:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em>pctile pvariable = variable, nquantiles(N+1)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;genp(percent_variable)</em></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em>gen inv_normal_variable=invnormal(percent_variable/100)</em></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(Where N is number of observations)</p><p>&nbsp;</p><p>3A. Lipid Traits</p><p>Phenotypes:</p><p>We will analyze fasting lipid values using two different trait distributions: raw values and after inverse normal transformation. If you only have non-fasting levels then you can contribute to all four lipids analyses, but your study may be excluded from some analyses.</p><p>(i.a) Total cholesterol (mg/dl; inverse normal)</p><p>(i.b) Total cholesterol&nbsp;(mg/dl; raw trait)</p><p>(ii.a) High-density lipoprotein (HDL) cholesterol (mg/dl; inverse normal)</p><p>(ii.b) High-density lipoprotein (HDL) cholesterol (mg/dl; raw trait)</p><p>(iii.a) Low-density lipoprotein (LDL) cholesterol<strong> </strong>(inverse normal)</p><p>(iii.b) Low-density lipoprotein (LDL) cholesterol (inverse normal)</p><p>(iv.a) Triglycerides (mg/dl; natural log -&gt; inverse normal)</p><p>(iv.b) Triglycerides (mg/dl; natural log transformed)</p><p>(v.a) Non-HDL cholesterol (nonhdlc) (TC-HDL; mg/dl; natural log -&gt; inverse normal)</p><p>(v.b) Non-HDL cholesterol (nonhdlc (TC-HDL; mg/dl; natural log transformed)</p><p>&nbsp;</p><p>&nbsp;</p><p><u>If you have both fasting and non-fasting measurements on the same individuals:</u> please use the fasting measurement.&nbsp;</p><p><u>If you have both fasting and non-fasting measurements in different individuals:</u> For LDL cholesterol and triglycerides, analyses should be carried out in fasting and non-fasting blood measurements separately. For total cholesterol and HDL cholesterol, fasting and non-fasting samples can be analyzed together.</p><p>For longitudinal studies, please use the baseline exam or earliest exam with fasting measures. Values should be in mg/dl.</p><p>&nbsp;</p><p><strong>Exclusions:</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Adults over age 18 should be analyzed separately from children under age 18.</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Exclude known Mendelian cases or obvious outliers likely to be data errors.</p><p><strong>&nbsp;</strong></p><p><strong>Perform phenotypic modeling separated by:</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Race/ethnicity/ancestry</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Sex</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Disease status if appropriate: analyze cases and controls separately if the phenotype is correlated with disease status.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Adult/child status</p><p>&nbsp;</p><p>(i) Total Cholesterol</p><p><u>Phenotype adjustment (prior to regression)</u></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Data collected before 1994 – no lipid medication adjustment</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Data collected after 1994 – for subjects on lipid medication replace TC by TC/0.8</p><p>&nbsp;</p><p>(i.a) Inverse normal transformed</p><p>Model: Generate residuals and inverse normal transform in men and women separately&nbsp;and separately by case status if appropriate (e.g. where disease status is correlated with cholesterol you will have MenCase, MenControl, WomenCase, WomenControl, SexCombinedCase, and SexCombinedControl). For the sex combined analyses, combine the “men-specific_TC_INV” and women-specific_TC_INV” phenotype values to analyze together (all_TC_INV).</p><p>&nbsp;</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Total cholesterol (raw trait value in mg/dl for men) = age + age<sup>2</sup> + PCs (+ other study specific covariates as needed) -&gt; residuals -&gt; inverse normal transformation (men-specific_TC_INV).</p><p>&nbsp;</p><p>NOTE: GLGC requests that you include ~4 PCs as study-specific covariates.</p><p>&nbsp;</p><p>(i.b) Raw trait</p><p>Model: Only sex-combined. Generate residuals with sexes combined, but separately by case status if appropriate (e.g. where disease status is correlated with cholesterol you will have SexCombinedCase and SexCombinedControl).</p><p>&nbsp;</p><p>Total cholesterol (raw trait value in mg/dl) = age + age<sup>2</sup> + sex + PCs (+ other study specific covariates as needed) -&gt; residuals&nbsp;(TC_RAW)</p><p>&nbsp;</p><p>NOTE: GLGC requests that you include ~4 PCs as study-specific covariates.</p><p>&nbsp;</p><p>(ii) High-density lipoprotein (HDL) Cholesterol</p><p>(ii.a) Inverse normal transformed</p><p>Model: Generate residuals and inverse normal transform in men and women separately and separately by case status if appropriate (e.g. where disease status is correlated with cholesterol you will have MenCase, MenControl, WomenCase, WomenControl, SexCombinedCase, and SexCombinedControl). For the sex-combined analyses, combine the “men-specific_HDL_INV” and women-specific_HDL_INV” phenotype values to analyze together (all_HDL_INV).</p><p>&nbsp;</p><p>HDL cholesterol (raw trait value in mg/dl) = age + age<sup>2</sup> + PCs (+ other study specific covariates as needed) -&gt; residuals -&gt; inverse normal transformation (HDL_INV)</p><p>&nbsp;</p><p>NOTE: GLGC requests that you include ~4 PCs as study-specific covariates.</p><p>&nbsp;</p><p>(ii.b) Raw trait</p><p>Model: Only sex-combined. Generate residuals with sexes combined, but separately by case status if appropriate (e.g. where disease status is correlated with cholesterol you will have SexCombinedCase and SexCombinedControl).</p><p>&nbsp;</p><p>HDL cholesterol (raw trait value in mg/dl) = age + age<sup>2</sup> + sex + PCs (+ other study specific covariates as needed) -&gt; residuals&nbsp;(HDL_RAW)</p><p>&nbsp;</p><p>NOTE: GLGC requests that you include ~4 PCs as study-specific covariates.</p><p>&nbsp;</p><p>(iii) Low-density lipoprotein (LDL) Cholesterol</p><p><u>Phenotype adjustment (prior to regression)</u></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;If not measured, LDL cholesterol can be calculated using the Friedewald equation for those with TG &lt; 400 mg/dl</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;LDL = TC – HDL – (TG/5); if TC modified as described above for medication use after 1994, the modified TC is used in this formula.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;If LDL was measured after 1994 (measured and not estimated by Friedewald), then adjust LDL values for individuals taking lipid-lowering medication by using LDL/0.7 to approximate pre-medication LDL levels.</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>(iii.a) Inverse normal transformed</p><p>Model: Generate residuals and inverse normal transform in men and women separately and separately by case status if appropriate (e.g. where disease status is correlated with cholesterol you will have MenCase, MenControl, WomenCase, WomenControl, SexCombinedCase, and SexCombinedControl). For the sex combined analyses, combine the “men-specific_LDL_INV” and women-specific_LDL_INV” phenotype values to analyze together (all_LDL_INV).</p><p>&nbsp;</p><p>LDL cholesterol (raw trait value in mg/dl) = age + age<sup>2</sup> + PCs (+ other study specific covariates as needed) -&gt; residuals -&gt; inverse normal transformation (LDL_INV)</p><p>&nbsp;</p><p>NOTE: GLGC requests that you include ~4 PCs as study-specific covariates.</p><p>&nbsp;</p><p>(iii.b) Raw trait</p><p>Model: Only sex-combined. Generate residuals with sexes combined, but separately by case status if appropriate (e.g. where disease status is correlated with cholesterol you will have SexCombinedCase and SexCombinedControl).</p><p>&nbsp;</p><p>LDL cholesterol (raw trait value in mg/dl) = age + age<sup>2</sup> + sex + PCs (+ other study specific covariates as needed) -&gt; residuals&nbsp;(LDL_RAW)</p><p>&nbsp;</p><p>NOTE: GLGC requests that you include ~4 PCs as study-specific covariates.</p><p>&nbsp;</p><p>(iv) Triglycerides</p><p>(iv.a) Natural log + inverse normal transformed</p><p>Model: Generate residuals and inverse normal transform in men and women separately and separately by case status if appropriate (e.g. where disease status is correlated with cholesterol you will have MenCase, MenControl, WomenCase, WomenControl, SexCombinedCase, and SexCombinedControl). For the sex combined analyses, combine the “men-specific_logTG_INV” and women-specific_logTG_INV” phenotype values to analyze together (all_logTG_INV).</p><p>&nbsp;</p><p>ln(raw Triglycerides trait value in mg/dl) = age + age<sup>2</sup> + PCs (+ other study specific covariates as needed) -&gt; residuals -&gt; inverse normal transformation (logTG_INV)</p><p>&nbsp;</p><p>NOTE: GLGC requests that you include ~4 PCs as study-specific covariates.</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>(iv.b) Natural log transformed</p><p>Model: Only sex-combined. Generate residuals with sexes combined, but separately by case status if appropriate (e.g. where disease status is correlated with cholesterol you will have SexCombinedCase and SexCombinedControl).</p><p>&nbsp;</p><p>ln(raw Triglycerides trait value in mg/dl) = age + age<sup>2</sup> + sex + PCs (+ other study specific covariates as needed) -&gt; residuals&nbsp;(logTG_RAW)</p><p>&nbsp;</p><p>NOTE: GLGC requests that you include ~4 PCs as study-specific covariates.</p><p>&nbsp;</p><p>(v) Non-HDL cholesterol</p><p><u>Use medication-adjusted TC generated in i) and subtract HDL-cholesterol</u></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Data collected before 1994 – no lipid medication adjustment</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Data collected after 1994 – for subjects on lipid medication replace TC by TC/0.8</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Non-HDL = TC (adjusted) – HDL</p><p><br></p><p>(v.a) Inverse normal transformed</p><p>Model: Generate residuals and inverse normal transform in men and women separately and separately by case status if appropriate (e.g. where disease status is correlated with cholesterol you will have MenCase, MenControl, WomenCase, WomenControl, SexCombinedCase, and SexCombinedControl). For the sex combined analyses, combine the “men-specific_nonHDL_INV” and women-specific_nonHDL_INV” phenotype values to analyze together (all_nonHDL_INV).</p><p><br></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Non-HDL cholesterol (raw trait value in mg/dl for men) = age + age<sup>2</sup> + PCs (+ other study specific covariates as needed) -&gt; residuals -&gt; inverse normal transformation (men-specific_nonHDL_INV).</p><p><br></p><p>(v.b) Raw trait</p><p>Model: Only sex-combined. Generate residuals with sexes combined, but separately by case status if appropriate (e.g. where disease status is correlated with cholesterol you will have SexCombinedCase and SexCombinedControl).</p><p><br></p><p>Non-HDL cholesterol (raw trait value in mg/dl) = age + age<sup>2</sup> + sex + PCs (+ other study specific covariates as needed) -&gt; residuals&nbsp;(nonHDL_RAW)</p><p>&nbsp;</p><p>&nbsp;</p><p><br></p><p>&nbsp;</p><p>4. Genotype-phenotype association</p><p>A. Group samples for analysis</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Please analyze major ancestry groups separately.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;We anticipate that some studies will have data from multiple genotyping arrays on samples from the same cohort. We expect there will likely be three typical situations:</p><p>o&nbsp;&nbsp;No sample overlap: analyze studies separately (batches with reasonably similar arrays can be analyzed together, using the array type as a covariate).</p><p>o&nbsp;&nbsp;All samples overlap: either a) select 1 array for imputation or ideally b) merge genotypes prior to imputation and perform a single analysis.</p><p>o&nbsp;&nbsp;Partial but significant overlap of samples - contact us, if needed, to customize a plan. The goal should be to upload sets of results from non-overlapping samples that can be combined in meta-analysis.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;If a set of samples being analyzed together is particularly large (for example, N&gt;30000), the association plan may need to be modified.&nbsp;Please contact us to discuss further if this is the case.</p><p>&nbsp;</p><p>B. Perform association analyses</p><p>Always test additive models using linear regression, using a method that accounts for genotype imputation uncertainty, and also accounting for known or cryptic relatedness (see below).&nbsp;Please indicate in your submission README file what method you have used for association analysis.</p><p>&nbsp;</p><p>Each individual study will perform data quality control (QC) and analysis and provide summary results for meta-analysis. Results files will be deposited to a central repository (details are provided below) where QC/data cleaning and meta-analysis will be performed.&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>We request association analyses be carried out using rvtests (version 20170210). </strong></p><p>&nbsp;</p><p>This software can be used for samples that include families or when an empirical kinship matrix is required for analysis. The input files required (phenotype, covariates) for rvtests are compatible with PLINK formats. It also calculates Hardy-Weinberg p-value and call rate for quality control purposes. We ask each study to generate kinship matrices (one for the autosomes and one for chromosome X) and fit linear mixed models to deliver single variant analysis results for the additive model.&nbsp;Documentation for rvtests can be found here: <a href=\"https://github.com/zhanxw/rvtests\" rel=\"noopener noreferrer\" target=\"_blank\">https://github.com/zhanxw/rvtests</a></p><p>&nbsp;</p><p>If you are unable to use a linear mixed model for some reason, please correct for ancestry/relatedness. At a minimum, use ~10 principal components as covariates to correct for population stratification and include principal components as indicated in the analysis models below. If you do not use rvtests, your results may not be usable for conditional analyses and aggregated analyses of rare variants. If in doubt, we are happy to advise. Please indicate in the Excel file requested below the method used to account for ancestry/relatedness.</p><p>&nbsp;</p><p><strong>1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Summary level statistics for meta-analysis of variant associations</strong></p><p>The following summary level statistics will be generated and shared for meta-analysis of variant associations, ideally using rvtests. rvtests requires an indexed VCF file (for genotypes), a PED file (for phenotypes) as input. Instructions below are for rvtests. If you are using a different method, please contact us.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;i.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Basic VCF metrics</strong>, including reference and alternative alleles, chromosome positions and strand. These statistics are not directly used in the computation of the variant tests but are needed for interpretation and meta-analysis.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ii.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Allele frequency for each variant</strong></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;iii.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Single variant association test statistics, including direction of effect.</strong> We use score statistics calculated at each variant site. Another possible option would be to share estimates of genetic effects – but, when variant frequencies are low, score statistics are more numerically stable and preferred.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;iv.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Covariance matrix for each genetic region.</strong> We compute the genotype covariance for all variants in a sliding window, with a width of 500,000 base pairs. This matrix reflects linkage disequilibrium in the region and will be used for meta-analysis of aggregate region- or gene-based tests of rare/low-frequency variation. <strong>&nbsp;</strong></p><p><br></p><p><strong> 2. Indexing the VCF files</strong></p><p>rvtest works with tabix, and takes indexed bgzipped VCF files as input.</p><p>&nbsp;</p><p>If your VCF file is not compressed with bgzip please use the following command</p><p><em>(grep ^\"#\" $your_old_vcf; grep -v ^\"#\" $your_old_vcf | sed 's:^chr::ig' | sort -k1, 1n -k2, 2n) | bgzip -c &gt; $your_vcf_file </em></p><p>&nbsp;</p><p>Please index your bgzip compressed VCF files using the following command:</p><p><em>tabix -f -p vcf $your_vcf_file</em></p><p>Please make sure there are no entries with -1’s or 0’s in the chromosome number column.</p><p><strong>&nbsp;</strong></p><p><strong>3. Specify VCF files</strong></p><p>You should use --inVcf&nbsp;$your_vcf_file to specify which VCF to use.</p><p>&nbsp;</p><p><strong>4. Specify phenotypes</strong></p><p>The rvtest tool requires a simple pedigree file that starts with the standard 5 columns (family id, individual id, father id, mother id and sex) followed by trait or trait residuals.</p><p>You can use --mpheno $phenoypeColumnNumber or --pheno-name to specify a given phenotype.</p><p>An example phenotype file, (example.pheno), has the following format:</p><p>&nbsp;</p><p>fid iid fatid matid sex y1 y2 y3 y4</p><p>P1 P1 0 0 0 1.7642934435605 -0.733862638327895 -0.980843608339726 1</p><p>P2 P2 0 0 0 0.457111744989746 0.623297281416372 -2.24266162284447 0</p><p>P3 P3 0 0 0 0.566689682543218 1.44136462889459 -1.6490100777089 0</p><p>P4 P4 0 0 0 0.350528353203767 -1.79533911725537 -1.11916876241804 0</p><p>P5 P5 0 0 1 2.72675074738545 -1.05487747371158 -0.33586430010589 1</p><p>&nbsp;</p><p>Phenotype file is specified by the option --pheno example.pheno. The default phenotype column header is “y1”. If you want to use alternative columns as phenotype for association analysis (e.g the column with header y2), you may specific the header names using either</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--mpheno 2 or</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--pheno-name y2</p><p>&nbsp;</p><p><strong>NOTE:</strong> to use “--pheno-name” the header line must start with “fid iid” as PLINK requires.</p><p>In phenotype file, missing values can be denoted by NA or any non-numeric value. Individuals with missing phenotypes will be automatically dropped from subsequent association analysis. For each missing phenotype value, a warning will be generated and recorded in the log file.</p><p><strong>&nbsp;</strong></p><p><strong>Optional: If using rvtests for phenotype transformation:</strong></p><p>If you would like to calculate residuals using the rvtest software please refer to the covariates that need to be included for each trait as described in the phenotype transformation step and use&nbsp;--covar and --covar-name options to designate covariates, and the --inverseNormal and --useResidualAsPhenotype while performing the analysis.</p><p>The covariate file, (e.g. example.covar) has a similar format as the phenotype file, e.g.:</p><p>fid iid age bmi covCenter1 covCenter2 covCenter3</p><p>P1 P1 23 24.2 1 0 0</p><p>P2 P2 32 29.0 0 1 0</p><p>P3 P3 44 32.4 0 0 1</p><p>P4 P4 25 28.2 1 0 0</p><p>&nbsp;</p><p>NOTE: Missing data in the covariate file can be labeled by any non-numeric value (e.g. NA). Missing values will automatically be imputed to the mean value in analysis.</p><p><strong>&nbsp;</strong></p><p><strong>5. Generate kinship matrices </strong></p><p>We ask all studies to use an <strong>empirical kinship matrix (aka genomic relationship matrix)</strong> for use in analysis with rvtests. If you do not already have a kinship matrix for your study it can be generated with rvtests.</p><p>&nbsp;</p><p>Kinship matrices are needed <strong>for all studies</strong> to account for familial relatedness, cryptic relatedness, and population stratification. rvtests generates an empirical kinship matrix from the VCF file. Within the rvtests folder there is a script called “vcf2kinship”. However, we want to run it on all common markers (MAF ≥ 5%) genome-wide so we first must create a concatenated VCF file from all chromosomes.&nbsp;&nbsp;If this step is still too slow, you may want to further prune the VCF file with MAF ≥ 5% markers to include only genotyped variants – please contact us if you need advice on this step.</p><p><em>&nbsp;</em></p><p><em># Concatenate per-chromosome imputed polymorphic genotypes VCF files into single VCF file </em></p><p><em>(zcat yourvcffile.HRCimputed.chr1.imputed.poly.vcf.gz; </em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr2.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr3.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr4.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr5.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr6.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr7.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr8.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr9.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr10.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr11.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr12.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr13.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr14.imputed.poly.vcf.gz; \\ </em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr15.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr16.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr17.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr18.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr19.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr20.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr21.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chr22.imputed.poly.vcf.gz; \\</em></p><p><em>&nbsp;&nbsp;zgrep -v '^#' yourvcffile.HRCimputed.chrX.reordered.imputed.poly.vcf.gz) | bgzip -c &gt; yourvcffile.HRCimputed.chrALL.imputed.poly.vcf.gz </em></p><p><em>&nbsp;</em></p><p>This will effectively duplicate the imputed genotype data. If disk space is a concern, this alternative requires less storage space by keeping only variants above 5%. Use this for creating the kinship matrix, but the full polymorphic VCFs for association.</p><p><em>&nbsp;</em></p><p><em>(bcftools view –q 0.05:minor yourvcffile.HRCimputed.chr1.imputed.poly.vcf.gz -O u ; \\</em></p><p><em>&nbsp;bcftools view –q 0.05:minor yourvcffile.HRCimputed.chr2.imputed.poly.vcf.gz -O u \\</em></p><p><em>| zgrep -v '^#'; \\</em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;[ditto through chr3-22]</em></p><p><em>bcftools view –q 0.05:minor yourvcffile.HRCimputed.chrX.imputed.poly.vcf.gz -O u \\</em></p><p><em>| zgrep -v '^#') \\</em></p><p><em>| bgzip –c &gt; yourvcffile.HRCimputed.chrALL.imputed.mafge5pct.vcf.gz</em></p><p><em>&nbsp;</em></p><p><em>### Generate kinship matrix (--threads controls the number of parallel threads, adjust as needed) </em></p><p><em>#!/bin/bash</em></p><p><em>vcf2kinship --inVcf&nbsp;yourvcffile.HRCimputed.chrALL.imputed.poly.vcf.gz \\ </em></p><p><em>&nbsp;&nbsp;-- ped yourpedfile.ped \\</em></p><p><em>&nbsp;&nbsp;--bn \\ #balding-nichols method </em></p><p><em>&nbsp;&nbsp;--out kinship_matrix \\ #output file name prefix </em></p><p><em>&nbsp;&nbsp;--xLabel X \\ #Label we used for the X chromosome </em></p><p><em>&nbsp;&nbsp;--xHemi \\ #create kinship for hemizygous region </em></p><p><em>&nbsp;&nbsp;--minMAF .05 \\ #min MAF of variants that contribute to the kinship matrix </em></p><p><em>&nbsp;&nbsp;--thread 12</em></p><p>&nbsp;</p><p>NOTE: <em>vcf2kinship</em> will produce a warning message if there are heterozygous genotype calls present for males in the hemizygous region, and then sets these genotypes to missing to produce the kinship matrix.&nbsp;These samples should have been removed – see section 2.3 above.</p><p><strong>&nbsp;</strong></p><p><strong>6. Exemplar command:</strong></p><p>The following are example commands for using rvtests to generate score statistics and covariance matrices. It can be used if you have previously generated residuals that have been inverse normally transformed or if you are using rvtests to generate residuals and perform the inverse normal transformation.</p><p>&nbsp;</p><p>Brief example: <em>rvtests --inVcf input.vcf --pheno phenotype.ped --pheno-name HT_INV --out output --kinship kinship_matrix --meta score,cov[windowSize=500000] --dosage DS</em></p><p><em>&nbsp;</em></p><p>IMPORTANT NOTE: The [windowSize=500000] option is shell-specific. It works in bash, but not in csh. It may not work in other Unix shells. Therefore, we recommend running all rvtest jobs in a bash shell.</p><p>&nbsp;</p><p><strong>Analyses will loop through chromosomes </strong></p><p>Many of the steps in this analysis plan will be done chromosome by chromosome. One very easy way to run by chromosome is with a <em>for</em> loop in bash or c-shell.&nbsp;An example is provided below; modify as appropriate for the phenotypes, sexes, and ancestries available in your study, the panel(s) being used for imputation, and for job submission with your compute resources.</p><p>&nbsp;</p><p>NOTE: Some of these lines are not used if you have already generated residuals and performed inverse normal transformation. These are indicated in red. If using rvtest to generate residuals, input covariates are not consistent for all analyses.</p><p><em>&nbsp;</em></p><p>For chrX, male genotypes in rvtest can be coded as 0, 1, 0/0, or 1/1, and dosages should be between 0 and 1. rvtest will convert these to a 0-2 scale automatically in analysis. rvtest already has preset values for the pseudo-autosomal regions (PAR), and properly adjusts analysis accordingly. rvtest will perform analysis on both PAR and non-PAR regions, but only calculates HWE and alleles counts in females for non-PAR regions. rvtest association analysis should be conducted on polymorphic variants only.</p><p><em>&nbsp;</em></p><p><em>&nbsp;</em></p><p><em>&nbsp;</em></p><p><em>&nbsp;</em></p><p><em>&nbsp;</em></p><p><em>#!/bin/bash</em></p><p><em>#replace the following variables and values as needed to match traits, ancestries, sexes, and reference panels available for your study</em></p><p><em>###trait=TC_INV, logTG_INV, HDL_INV, LDL_INV, TC_RAW, logTG_RAW, HDL_RAW, LDL_RAW, Height, BMI, WHRadjBMI, WHRunadjusted </em></p><p><em>###ancestry=EUR, </em>AFR, AMR, SAS, EAS</p><p><em>###sex=MEN,WOMEN,ALL</em></p><p><em>###panel=1KGP3,HRC</em></p><p><em>for i in `1 22` X; do #Loop over chromosomes </em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;rvtest --inVcf yourvcffile.${panel}.chr${i}.imputed.poly.vcf.gz \\ #Input vcf </em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--pheno study_${ancestry}_pheno.ped \\ #Input phenotype ped file </em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--pheno-name ${trait} \\ #Name the phenotype column in the phenotype ped file</em></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em>--meta score,cov[windowSize=500000]</em>&nbsp;\\ #Generate single variant score test&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;#and genotype covariance matrix with a window size of 500kb around&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;#each variant. Use for only largest N trait (cases and controls)</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--meta score \\ #Use for all other traits (does not generate covariance matrix)</p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--kinship kinship_matrix.kinship \\</em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--covar study_${ancestry}_cov.ped \\ #Name of covariate file, if using one </em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--covar-name sex, age, age2, \\ #Names of covariates only if using covariates (that is, if&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;#residuals not already calculated and inverse normal transformed)</em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--useResidualsAsPhenotype \\ #Residualize before testing variants only if not already&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;#calculated</em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--inverseNormal \\ #Inverse normalize the residual distribution only if not already&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;#calculated </em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--xLabel &lt;value&gt; \\ #Flag can be added if chrX is coded other than X in VCF (e.g. 23)</em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--xHemiKinship kinship_matrix.xHemiKinship \\ #use instead of --kinship to indicate&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;#chrX analysis </em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--dosage DS \\ #Specify vcf dosage field </em></p><p><em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;--out STUDY_${ancestry}_${panel}_imputation_${trait}_chr${i}</em></p><p><em>&nbsp;done </em></p><p><strong>&nbsp;</strong></p><p><u>Combine your results files</u></p><p>The following example command, corresponding to the outputs from the example command provided above, will concatenate all per-chromosome results into one output file for each ancestry x trait combination. For other reference panels, phenotypes, etc. please modify as appropriate.</p><p>&nbsp;</p><p>Please combine the set of score test results and the covariance matrix files across chromosomes to generate a single cumulative file across all autosomes for each data type (i.e., 1 metaScore file including all autosomes and 1 metaCov file for all autosomes). Keep and upload chrX separate from the autosomes.&nbsp;You will only upload one metaCov file in total (not one per trait, see File Naming and Uploading in section 8, below.)</p><p>&nbsp;</p><p><em># Concatenate association results into a single file </em></p><p><em>#!/bin/bash</em></p><p><em>### trait=TC_INV, logTG_INV, HDL_INV, LDL_INV, TC_RAW, logTG_RAW, HDL_RAW, LDL_RAW, Height, BMI, WHRadjBMI, WHRunadjusted </em></p><p><em>###ancestry=EUR,AFR,AMR,SAS,EAS #replace this as needed with the appropriate ancestry </em></p><p><em>###sex=MEN,WOMEN,ALL</em></p><p><em>###panel=1KGP3,HRC</em></p><p><em>(</em></p><p><em>zgrep -E -h&nbsp;'^1\\s|#|CHROM' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr1.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h '^2\\s'&nbsp;STUDY_${ancestry}_${panel}_${trait}_${sex}_chr2.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h '^3\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr3.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h '^4\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr4.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h '^5\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr5.MetaScore.assoc.gz;\\</em></p><p><em>zgrep -E -h&nbsp;'^6\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr6.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h '^7\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr7.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h '^8\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr8.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h '^9\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr9.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h&nbsp;'^10\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr10.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h&nbsp;'^11\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr11.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h&nbsp;'^12\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr12.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h&nbsp;'^13\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr13.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h&nbsp;'^14\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr14.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h&nbsp;'^15\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr15.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h&nbsp;'^16\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr16.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h&nbsp;'^17\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr17.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h&nbsp;'^18\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr18.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h&nbsp;'^19\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr19.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h&nbsp;'^20\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr20.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h&nbsp;'^21\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr21.MetaScore.assoc.gz; \\</em></p><p><em>zgrep -E -h&nbsp;'^22\\s' STUDY_${ancestry}_${panel}_${trait}_${sex}_chr22.MetaScore.assoc.gz; \\</em></p><p><em>zgrep –E –h ‘^X\\s’ STUDY_${ancestry}_${panel}_${trait}_${sex}_chrX.MetaScore.assoc.gz)&nbsp;| bgzip -c &gt; STUDY_${ancestry}_${panel}_${trait}_${sex}_STATUS_DATE_ANALYST_ANALYSIS.MetaScore.assoc.gz&nbsp;</em></p><p><em>&nbsp;</em></p><p>Then, for the trait with the largest sample size, merge the *.MetaCov.assoc.gz files.</p><p>There will be one covariance matrix per ancestry, and separate matrices if analyses were separated into cases and controls.</p><p>&nbsp;</p><p><strong>7. Output Files</strong></p><p>rvtest will generate three files for sharing. The first has the summary statistics (from single variant score tests); the second has linkage disequilibrium (LD) matrices summarizing covariance between single marker score statistics, and the third provides a log file with all parameter settings. These three files are required for central meta-analysis and QC.</p><p>Using “--out <em>output</em>” options, the results are stored in <em>output.MetaScore.assoc</em> and <em>output.MetaCov.assoc.gz</em>. Each output file contains a header with summaries of trait and covariates.</p><p>&nbsp;</p><p>The file <em>output.MetaScore.assoc.gz</em> file contains the following columns:</p><p>CHROM, POS, REF, ALT: chromosome name, position, reference allele and alternative allele</p><p>N_INFORMATIVE: number of samples in the analysis</p><p>AF: allele frequency</p><p>INFORMATIVE_ALT_AC: number of alternative alleles&nbsp;&nbsp;</p><p>CALL_RATE: fraction of non-missing genotypes&nbsp;&nbsp;</p><p>HWE_PVALUE: Hardy-Weinberg Equilibrium P-value.&nbsp;</p><p>N_REF, N_HET, N_ALT: number of reference/reference, reference/alternative, alternative/alternative genotypes respectively.</p><p>U_STAT, SQRT_V_STAT: U statistic and square root of V statistic as in the score test.&nbsp;</p><p>ALT_EFFSIZE: estimated effect size using alternative allele.&nbsp;</p><p>PVALUE: P-value when testing genetic association using score test.</p><p>&nbsp;</p><p>The <em>output.MetaCov.assoc.gz</em> contains following columns:</p><p>CHROM: Chromosome name</p><p>START_POS, END_POS: Chromosomal positions of the first and the last variant in the sliding window.</p><p>NUM_MARKER: number of variants in the sliding window.</p><p>MARKER_POS: variant chromosomal positions in the sliding window.</p><p>COV: covariance for each pair of test statistics in the sliding window.</p>"
        },
        {
            "header": "Troubleshooting",
            "content": ""
        },
        {
            "header": "Time Taken",
            "content": ""
        },
        {
            "header": "Anticipated Results",
            "content": ""
        },
        {
            "header": "References",
            "content": ""
        }
    ],
    "attributes": {
        "acceptedTermsAndConditions": true,
        "allowDirectSubmit": true,
        "archivedVersions": [],
        "articleType": "Method Article",
        "associatedPublications": [],
        "authors": [
            {
                "id": 59294410,
                "identity": "d6bc1b8f-2bbb-45b9-98d2-62d8098963ee",
                "order_by": 0,
                "name": "Cristen Willer",
                "email": "cristen@umich.edu",
                "orcid": "",
                "institution": "",
                "correspondingAuthor": true,
                "prefix": "",
                "firstName": "Cristen",
                "middleName": "",
                "lastName": "Willer",
                "suffix": ""
            }
        ],
        "badges": [],
        "createdAt": "2021-10-26 16:43:45",
        "currentVersionCode": 1,
        "declarations": "",
        "doi": "10.21203/rs.3.pex-1687/v1",
        "doiUrl": "https://doi.org/10.21203/rs.3.pex-1687/v1",
        "draftVersion": [],
        "editorialEvents": [],
        "editorialNote": "",
        "failedWorkflow": [],
        "files": [
            {
                "id": 15980122,
                "identity": "fb8e3183-54a5-4de4-b2cc-ec8239c09a00",
                "added_by": "auto",
                "created_at": "2021-11-29 18:52:53",
                "extension": "pdf",
                "order_by": 0,
                "title": "",
                "display": "",
                "copyAsset": false,
                "role": "manuscript-pdf",
                "size": 586673,
                "visible": true,
                "origin": "",
                "legend": "",
                "description": "",
                "filename": "manuscript.pdf",
                "url": "https://assets.researchsquare.com/files/pex-1687/v1/dd9d6a1a-abdf-47ca-9eea-5dad4f8dd7d6.pdf"
            }
        ],
        "financialInterests": "",
        "fulltextSource": "",
        "fullText": "",
        "funders": [],
        "hasOptedInToPreprint": true,
        "hasPassedJournalQc": "",
        "hideJournal": true,
        "highlight": "",
        "institution": "",
        "isAuthorSuppliedPdf": false,
        "isDeskRejected": "",
        "isHiddenFromSearch": false,
        "isInQc": false,
        "isInWorkflow": false,
        "journal": {
            "display": true,
            "email": "protocol.exchange@nature.com",
            "identity": "protocol-exchange",
            "isNatureJournal": false,
            "hasQc": false,
            "allowDirectSubmit": true,
            "externalIdentity": "",
            "sideBox": "",
            "submissionUrl": "https://protocolexchange.researchsquare.com/submission",
            "title": "Protocol Exchange",
            "twitterHandle": ""
        },
        "keywords": "GLGC, GWAS, Lipids, meta-analysis, cholesterol",
        "license": {
            "name": "CC BY 4.0",
            "url": "https://creativecommons.org/licenses/by/4.0/"
        },
        "manuscriptAbstract": "<p>This protocol describes the guidelines for generating GWAS summary statistics that were provided to all participating cohorts in the Global Lipids Genetics Consortium HRC + 1KGP3 imputation meta-analysis collected jointly with the GIANT consortium.  It is applicable for generating the input phenotype and genotype files for use with the rvtests software.  Key stages include imputation, generating phenotype files, and running the analysis to generate summary statistics.  The exact time needed to carry out this protocol varies depending on the existing genotype files and size of the cohort. The latest version of rvtests is available at: http://zhanxw.github.io/rvtests/</p><p><br></p>",
        "manuscriptTitle": "Analysis plan for primary cohort GWAS for blood lipid levels for the Global Lipids Genetics Consortium",
        "msid": "",
        "msnumber": "",
        "nonDraftVersions": [
            {
                "code": 1,
                "date": "2021-11-29 18:52:48",
                "doi": "10.21203/rs.3.pex-1687/v1",
                "editorialEvents": [
                    {
                        "type": "communityComments",
                        "content": 0
                    }
                ],
                "status": "published",
                "journal": {
                    "display": true,
                    "email": "info@researchsquare.com",
                    "identity": "researchsquare",
                    "isNatureJournal": false,
                    "hasQc": true,
                    "allowDirectSubmit": true,
                    "externalIdentity": "",
                    "sideBox": "",
                    "submissionUrl": "/submission",
                    "title": "Research Square",
                    "twitterHandle": "researchsquare"
                }
            }
        ],
        "origin": "",
        "ownerIdentity": "5f464bc2-7532-454f-98fb-598fedbfb9a1",
        "owner": [],
        "postedDate": "November 29th, 2021",
        "published": true,
        "revision": "",
        "status": "posted",
        "subjectAreas": [
            {
                "id": 8824146,
                "name": "Genetics"
            }
        ],
        "tags": [],
        "versionOfRecord": [],
        "versionCreatedAt": "2021-11-29 18:52:48",
        "video": "",
        "vorDoi": "",
        "vorDoiUrl": "",
        "workflowStages": []
    }
}