[
  {
    "title": "",
    "body": [
      {
        "sentence": "Clean glass plates with 70 % ethanol, followed by acetone for easy removal of the gel during disassembly later-on. Assemble the glass plates with spacers and secure with bull clips on each side . Heat 1 % agarose in microwave to liquefy. Seal gel plate assembly with 1 % agarose to avoid leakage when pouring the gel : Holding the gel plates at a steep angle, pipet small amounts (about 1ml) of 1 % agarose in-between the plates so that it flows along the spacer towards the bottom of the gel . Once the agarose reaches the bottom, reverse the angle of the gel so the agarose covers as much of the bottom as possible . Keeping the gel in the reverse angle, add again agarose in-between the plates so that it flows along the other spacer (Fig. 1E), and as soon as the agarose reaches the bottom, swap the angle of the gel so that the agarose again covers as much of the bottom part as possible",
        "result": {
          "CLEAN": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Place a magnetic stir plate on an elevated surface (about 30 cm higher than the surface on which the assembled gel plates are standing). Place the gradient maker on the magnetic stir plate and add magnetic stir bars to mixing chambers. Ensure the valves are closed before dispensing the premix solution into the gradient maker. For a large gel, pipette 20 ml of 4 % and 20 ml of 17 % acrylamide premix to the left and right mixing chamber, respectively (Fig. 1G). Add to each chamber 200 µl of 10 % APS, and then 20 µl of TEMED. For a small gel, pipet into each chamber 6 ml of acrylamide premix, 60 µl of 10 % APS, and then 6 µl of TEMED. Allow the solutions to mix for only a few seconds.\n Important: As soon as TEMED is added it is important to work steadily to prevent early polymerisation of the acrylamide solution.",
        "result": {
          "PLACE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Open the valve between the mixing chambers, then open the outside valve, and if necessary trigger the flow by gently squeezing the delivery tube with the fingers in a downward motion. As soon as the liquid begins to flow, place the tubing near the top centre of the tall plate and allow the solution to run down the plate to avoid inclusion of air pockets in the gel (Fig. 1H). Insert a comb, immediately add dH2O to the chambers of the gradient former and let it exit through the tube, repeat. Let the gel polymerise for about 1 h, or longer if the APS is not fresh",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Carefully remove the comb and the bottom spacer. Using a squeeze bottle, rinse the wells with dH2O to remove excess acrylamide. Remove excess liquid",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Add running buffer to the bottom reservoir of the electrophoresis unit and wipe the surface with a paper towel to remove air bubbles. Mount the gel at an angle by placing one bottom corner in the buffer and slowly lowering the other bottom corner to allow air bubbles to escape. Check that the bottom of the gel is completely submerged in the buffer. Clamp the gel in place with bull clips and fill the top reservoir with running buffer until the wells are just covered. Using a 1 ml pipet, rinse the wells with running buffer prior to loading protein samples. Run the large gel at 250 V; 100 mA, and the small gel at 100-150 V (do not set a limit for Ampere) until the dye front is near the bottom of the gel.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Disassemble the plates carefully, remove the agarose and other excess parts of the gel. Equilibrate the gel in cold transfer buffer for a few minutes to remove SDS and potential gel fragments",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Submerge the membrane in 100% methanol for 15 seconds, and then soak it in cold transfer buffer for a few minutes, with gentle shaking to ensure the membrane stays fully submerged in the liquid.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Pre-wet a triple layer of 3MM filter paper in cold transfer buffer by submerging one side of the stack first and then slowly lowering it into the buffer. Simultaneous wetting of the pre-assembled triple layer prevents air bubble formation between the layers",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Place the 3MM filter paper stack on the clean bench. Align the pre-soaked membrane on top of the wet filter papers. Remove excess buffer and trapped air bubbles with the help of a blot roller or by rolling a pipette ",
        "result": {
          "PLACE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Place the soaked gel on top of the membrane. Remove air bubbles with a blot roller, a pipette or with your gloved hands",
        "result": {
          "PLACE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Finally, add 3 sheets of pre-wetted 3MM filter paper onto the gel and gently remove air bubbles from the sandwich as described above .\n Important: Once assembled, do not reposition the sandwich layers.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Transfer the above sandwich to the semi-dry transfer unit: Carefully, avoiding entrapment of air bubbles, lower the sandwich onto a small puddle of transfer buffer on the bottom electrode (anode) .\n Note: Multiple gels can be transferred simultaneously without affecting the transfer efficiency",
        "result": {
          "TRANSFER": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Using dry paper towels, carefully remove excess buffer from the electrodes, located on the sides of the sandwich, to avoid current leakage that may compromise the transfer",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Place the upper electrode (cathode) on top of anode plate",
        "result": {
          "PLACE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Transfer for 45 min at 25V, 1A. We use the same conditions irrespective of the size or the number of gels present in the transfer unit. For example, we used 8 x 7 cm or 17 x 8 cm large gels, and in both cases we were able to detect in yeast cell extract samples the low abundant 296 kDa large protein Gcn1. Simultaneous transfer of two 17 x 8 cm large gels still allowed detection of all proteins , except that in this case Gcn1 could only be detected in co-precipitation samples as a co-precipitating protein, but Gcn1 could not be detected in the input samples.\n Important: Check the voltage current status at the very beginning of transfer. If it takes too long (more than 3 min) to reach the set voltage, the transfer is likely to fail (see troubleshooting).",
        "result": {
          "TRANSFER": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "After the transfer is completed, disassemble the unit. Wash the membrane in TBS-T to remove residual SDS and potential gel fragments",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Check the efficiency of transfer by staining the membrane in Ponceau solution for 10 min.\n Tip: PVDF membrane staining sensitivity can be significantly increased if the membrane is incubated in 100 % methanol for approximately 15 seconds and immediately subjected to Ponceau staining. (Source unknown)",
        "result": {
          "CHECK": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Rinse the membrane with 1% [v/v] acetic acid until protein bands are clearly visible. Document the result using a document scanner or camera",
        "result": {
          "RINSE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Incubate the membrane for a few minutes in TBS-T, and proceed to immunoblotting following standard procedures",
        "result": {
          "INCUBATE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  }
]