[
  {
    "title": "",
    "body": [
      {
        "sentence": "Calibrate the Brüel & Kjaer pressure microphone with the acoustic calibrator, which generates a 1 kHz tone of 94 dB SPL (SPL = sound pressure level). Sample the output voltage signal of the microphone and cut the time trace into N time windows of length T. To obtain a frequency spectrum with a resolution, Δf, of 1 Hz, the length of each time window, T = 1/Δf, should be set to 1 s and the sampling frequency, f[S] = N[S]/T, should be 4096 or 8192 Hz, corresponding to a number of samples, N[S], of 212 and 213, respectively. Choosing N[S] to be a power of two makes it possible to apply Fast Fourier transformation (FFT analysis is implemented in many software packages, including the analysis software that comes with the PSV laser Doppler vibrometer). Determine the Fourier amplitude of the voltage signal at the stimulus frequency (1kHz).",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Place the pressure microphone and the reference microphone side by side in the acoustic far field of a loudspeaker for cross-calibration (acoustic far-field conditions are met if the distance from the loudspeaker is ≥ 2 lamda, where lambda is the wavelength of sound; when calibrated with a 1 kHz tone, the microphones should be placed ≥ ca. 0.64 m from the loudspeaker). Make sure that the diaphragm of the reference microphone faces the loudspeaker.",
        "result": {
          "PLACE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Generate a continuous 1 kHz signal with the function generator, pass it through the step attenuator and the audio amplifier, and broadcast it via the loudspeaker. Sample the output signals of both microphones and subject them to Fast Fourier transforms (see step 1). Determine the respective Fourier amplitudes at 1 kHz. Assume that the amplitude obtained for the pressure microphone is 50 mV, and that the calibration at 94 dB SPL (step 1) yielded an amplitude of 100 mV. The sound pressure corresponding to the 50 mV output is then calculated as 94 dB SPL + 20 log (50/100) = 88 dB SPL. Acoustic power per unit area is the product of the pressure, p, and the particle velocity, u, in the sound wave (under far field conditions), whereby a power of 0 dB (= 10–12 W m–2) is equivalent to p = 2 x 10–5 N m-2 and u = 5 x 10-8 m s-1. In the far field, the pressure p is proportional to the particle velocity u, so a pressure of 88 dB SPL corresponds to a particle velocity of 5 x 10-8 m s–1 x 1088/20 ≈ 1.3 mm s–1, providing a calibration factor for converting the voltage output of the reference microphone into particle velocities. The calibration should be performed for different stimulus intensities and frequencies to assay the intensity and the frequency characteristics of the reference microphone.",
        "result": {
          "GENERATE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "1.Microphone calibration",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "2.Animal preparation",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Heat the soldering iron to ca. 220ºC",
        "result": {
          "HEAT": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Briefly anesthetize the fly with CO2",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Melt a drop of wax to the tip of the Teflon rod. Use tweezers to grab the fly by its wings and wax it to the rod with its legs",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Use the additional, fine tips of the soldering iron to carefully wax the fly’s coxae to the rod so that the thorax is fixed and that the arista is oriented ca. perpendicular to the longitudinal axis of the rod (Fig. 1). Be careful not to touch the antenna with the wire since to avoid damaging the ear",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Wax the postero-lateral side of the head to the thorax and stabilize the halteres, wing-hinges, and proboscis with small drops of wax to minimize movements",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Blow on the antenna to test whether it still can move. This rough check helps uncovering eventual damage caused by the preparation",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "3.Mechanical measurements",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "The setup is arranged on the vibration isolation table, with the laser Doppler vibrometer (LDV) being positioned in the centre .  ",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Mount the rod holding the fly on a micromanipulator and position the manipulator so that the fly is at focal distance from the LDV.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Turn the rod so that the arista of one antenna is oriented perpendicular to the optical axis of the laser (the positioning can be controlled visually via the coaxial video capture system of the LDV.",
        "result": {
          "TURN": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Focus the laser on the tip of the arista of one antenna, and slightly change the position via the scanning unit of the LDV until a maximum level of backscattered laser light is obtained. The arista and the third antennal segment together form the sound receiver of the fly ",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Because these antennal parts move as a unit, analyzing the vibrations of the arista-tip is sufficient to explore the mechanical intensity and frequency characteristics of the antennal receiver. The loudspeaker for broadcasting acoustic stimuli is placed at a distance of ca. 10 cm behind the fly, with its diaphragm facing both the LDV and the fly",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "The second micromanipulator is used to bring the reference microphone close (distance ca. 5mm) to the measured antenna. Make sure that the measured arista and the microphone are equidistant to the loudspeaker and that the microphone membrane is perpendicular to the direction of sound propagation.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "4.Receiver vibrations in the absence of sound",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "The procedures for measuring the fluctuations of the fly's antennal receiver in the absence of external stimulation are described in Box 1 ",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "5.Receiver vibrations in response to sound",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "The procedures for measuring the vibrations of the fly's antennal receiver in response to pure tone stimuli are described in Box 2",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  }
]