[
  {
    "title": "",
    "body": [
      {
        "sentence": "Weigh 2.31 g sodium azide (35.5 mmol) and transfer to a 50 mL 1 neck round bottom flask equipped with a Teflon coated magnetic stir bar",
        "result": {
          "WEIGH": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Suspend the solid in 5 mL of DMF. Add 3.0 mL of ethylchloroacetate dropwise to the stirred mixture by syringe. These steps are carried out in open air and no effort was made to exclude water or oxygen",
        "result": {
          "SUSPEND": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "CAUTION Sodium azide is highly toxic and care should be taken to avoid contact during transfer and workup",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Cap the reaction vessel with a rubber septum and stir at room temperature for 24 hours.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "After 24 hours of reaction time, dilute the reaction mixture with diethyl ether (~10 mL) and transfer to a 250 mL seperatory funnel. Add an additional 140 mL of diethyl ether. Wash the mixture with deionized water (2 × 50 mL)",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Dry the organic layer over Na2SO4 in a 250 Erlenmyer with such an amount of Na2SO4 that the solid is free flowing when the flask is swirled. At this point filter off the drying agent and rinse with 25 mL diethyl ether.",
        "result": {
          "DRY": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Concentrate the product by rotary evaporation until the volume is approximately 10 mL. This solution is to be used directly in the next step",
        "result": {
          "CONCENTRATE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Seal a 100 mL 2-neck round bottom flask equipped with a Teflon coated magnetic stir bar with two rubber septa. Flush the flask with argon for 10 minutes using an argon filled balloon equipped with an 19 gauge disposable needle for both entry and another 19 gauge needle for an exit. Remove the exit needle after flushing with argon",
        "result": {
          "SEAL": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Add 0.65 mL of tripropargylamine (4.75 mmol) and 5.0 mL of acetonitrile by syringe. Cool the solution to 0 ºC using an ice/water bath and add 0.60 mL of 2,6-lutidine by syringe to the stirred solution. Add copper(I) iodide as a solid; carefully but quickly removing and replacing one of the septa during the addition.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "After all reagents have been added, flush the reaction with argon for 10 minutes. Remove the ice bath after one hour of stirring and stir at room temperature for 48 hours",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "After the prescribed reaction time, remove solvent by rotary evaporation and purify the residue by column chromatography by loading the residue onto a silica column with ethyl acetate and eluting with the same solvent. TLC analysis should be used to locate the fractions with the desired product",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Combine the fractions containing the product and remove the solvent by rotary evaporation. The product should be a white solid and can be used without additional purification",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "The solid can be crystallized if further purification is desired. Dissolve the solid in a minimal amount of boiling methanol. Cool slowly to room temperature and add diethyl ether dropwise until the solution is cloudy. Warm gently to redissolve all material and the let stand. The compound crystallizes as small white needles that can be isolated by filtration. Drying under vacuum is recommended.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  }
]