[
  {
    "title": "",
    "body": [
      {
        "sentence": "1.Preparation of 100 µl aliquote pool Combine protein stock solutions",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "11.7 µl ubiquitin, 8.61 µl lysozyme, 5.88 µl myoglobin, 5.7 µl trypsinogen, 6.71 µl GAPDH, 4.66 µl ovalbumin, 4.33 µl albumin, 23.1 µl phosphorylase B and add 29.31 µl Tris buffer (pH 8,5).",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "2.Denaturation \nHeat 45 µl of aliquote pool in a thermoshaker for 4 min at 95°C",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": " 3.Labeling Incubate 45 µl (51.53 µg) of the denatured aliquote pool (pH 8.5) with 1 µl Sci 3 for 30 min on ice. Stop labeling with 1 µl lysine solution for 10 min on ice",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "CRITICAL STEP Use a higher concentration of lysine than recommended by the manufacturer to avoid mislabeling due to quenching failure18. PAUSE POINT Aliquots can be stored at -80°C until further use.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "4.Reduction\nRinse Pall 3K filter units three times by centrifuging with cleaning solvent (3 x 500 µl, 5 min, 12,500 x g, 20°C). Transfer labeled grid mix to the filter unit and centrifuge (15 min, 12,500 x g, 20°C). For reduction, add 100 µl reducing buffer and vortex (45 min, 1,000 rpm). Centrifuge (15 min, 12,500 x g, 20°C).",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "5.Alkylation\nAdd 100 µl alkylation buffer to the filter unit and vortex in the dark (1,000 rpm, 30 min). Stop the process by centrifuging (15 min, 12,500 x g, 20°C) and rinsing with quenching buffer (100 µl; vortex for 15 min at 1,000 rpm; centrifuge for 30 min, 12,500 x g, 4°C).",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "6.Protein extraction\nAdd 100 µl Tris buffer to the filter unit and vortex (45 min, 1,000 rpm). Transfer the protein solution to a fresh tube.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "CRITICAL STEP If you wish to evaluate the protein concentration in addition to analyte spot correction, you need to determine the concentration of the grid mix proteins again after above procedure, because protein loss may occur4,14,15. PAUSE POINT Store the reference proteins at -32°C until further use.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": " 7.Lyse E. coli (25 mg) in 1 ml lysis buffer containing 1/10 tablet EDTA-free protease inhibitor cocktail Complete mini. Vortex (30 min) and centrifuge (12,000 x g, 4°C). Adjust the supernatant to pH 8-9. Determine the protein concentration at 590 nm using the Bradford-based Cytoskeleton kit ADV01. The protein amount should be at least 3 mg/ml.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "PAUSE POINT Protein solutions can be stored frozen until further use.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "8. Label E. coli lysate (50 µg) with 1 µl 400 pmol Sci 5 (30 min on ice). Quench the reaction with 1 µl lysine solution (10 min on ice). For subsequent IEF, add IEF buffer at 1:1 ratio. Vortex and centrifuge (1 min each).",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "9 .For passive rehydration of the IPG-strip without sample overnight (~14 h) prepare a trough of the rehydration tray with 450 µl rehydration buffer. Place the IPG-strip into the trough with the gel side down and overlay it with 3 ml mineral oil.\nAlternatively, if cup-loading is used, place the IPG strip gel side up into the manifold and pipet the sample (13.2 µl, total protein amount 50 µg) followed by mineral oil (10 µl) into a cup located on the anodic side of the strip.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "CRITICAL STEP In case of multiple parallel experiments, only load identical protein amounts per strip, e.g. 50 µg, for reliable results.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "10.Perform focusing at 20°C and 50 µA for 20 h (150 V – 3 h step, 300 V – 3 h step, 1 kV – 6 h grad, 8 kV – 4 h grad, 8 kV – 3 h step, 300 V – 1 h holding step).",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "11.Equilibrate the IPG-strip for 15 min each in equilibration buffers I and II (6 ml each). Place two electrode wicks separately into the wick tray and add 45 ml SERVA cathode and anode electrode buffer, respectively. Allow 15 min for buffer uptake. Spread cooling fluid (3 ml) on the cooling plate of one drawer of the FlatTop Tower.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "12. Load molecular weight marker Serva Triple Color Protein Standard III (5 µl; prestained protein ladder) into the dedicated well of the gel. Place the IPG strip into the designated trough face-down with the anode (+) side towards this marker well.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "13. Apply 0.5 µl labeled grid mix to each reference well immediately before the start of the second electrophoresis dimension.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "CRITICAL STEP If you wish to evaluate the protein concentration in addition to analyte spot correction, prepare the grid mix in different concentrations or apply different volumes to the wells4,14,15.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "14.Perform the 2nd dimension for ~ 6h ( 100 V, 7 mA, 1 W, 30 min; 200 V, 13 mA, 3 W, 30 min; 300 V, 20 mA, 5 W, 10 min; pause the power supply and remove pI-strip; restart the power supply, 1.5 kV, 40 mA, 30 W, 230 min; 1.5 kV, 50 mA, 40 W, 40 min). Stop the experiment when the running front reaches the end of the gel.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "15.Scan gels immediately using the green laser for Sci 3 (532 nm, emission filter 580, band pass (BP) 30, photomultiplier tube (PMT) 525) and the red laser for G-Dye300 (633 nm, emission filter 670, BP 30, PMT 490). Set the resolution for the main scans to 100 µm per pixel. Adapt the PMT response in such a way that the gel image shows the most intense protein spot slightly below saturation.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "16.Visualize gel images using ImageQuant software and store them",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "17. Delta 2D software has been specifically modified to allow user-friendly analysis of CoFGE projects. However, any image analysis software capable of warping will be suitable.\nFirst, chose a reference gel as discussed above (find examples in ref. 6-8). The x-coordinates of the nodes are determined by the well distances; the y-coordinates by the position of the marker protein spot. Match the individual marker grid for each gel to the chosen master grid by assigning every experimental grid spot to the corresponding spot of the theoretical grid. This process determines the match vectors for the respective gel.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "18. Apply the determined gel match vectors to the analyte proteome on this gel. Control the mapping of the match vectors manually.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  }
]