[
  {
    "title": "",
    "body": [
      {
        "sentence": "One day prior to the initiation of culture,combine of Notch antibodies (anti-Notch1 and anti-Notch2 antibodies, each at 10 micrograms/ml), or control antibod\u0010y (Armenian Hamster IgG Isotype Control Antibody, also at 20 micrograms/ml), together with either recombinant fibronectin fragment (5 micrograms/ml,retronectin,FN-CH-296) or recombinant mouse VCAM-1/CD106 Fc Chimera (5 micrograms/ml)toCa+Mg+-free PBS.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Add approximately 0.25 ml ligand solution per well of a non-tissue culture plastic 48-wellplate",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Incubate plate overnight at 4°C",
        "result": {
          "INCUBATE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Aspirateligandsolutionand add excess PBS one well at a timeensuring the well does not dry out. Repeat once.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Aspirate PBS from the well and add 0.4 ml of serum-freemedia per 48-well",
        "result": {
          "ASPIRATE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Setup timedmatingsof C57BI6/J7 (CD45.2) mice for generating embryonic tissues of the desired age",
        "result": {
          "SETUP": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Harvestembryos from pregnant females at 9.5 to 11.5 days post coitum (dpc), depending on the stage desired.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Dissect the AGM (or for E9.5 embryos, the central portion of the embryo proper containing the para-aortic splanchnopleure/P-Sp) from the embryos on ice-cold PBS with 10% FBS, as previously described7, pooling embryos from litters at the equivalent developmental stage based on somite numbers.",
        "result": {
          "DISSECT": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Collect the pooled P-Sp/AGM tissues in a 15ml conical tube containing 10 ml PBS with 10% FBS on ice. Gravity settle tissues and gently remove PBS/10% FBS. Add 1ml 0.25% collagenase. Place in a 37°C water bath for 25 min.  ",
        "result": {
          "COLLECT": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "dd 1 ml of PBS/10% FBS. Pipette about 20-30 times with a 1 ml pipette tip to obtain a single cell suspension. Add an additional 8 ml of PBS/10% FBS and centrifuge at 300 x g for 5 min. Discard the supernatant.  ",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Prepare the blocking buffer for antibody staining. Add 10 micrograms/ml anti-mouse CD16/CD32 (Fc receptor (FcR) block) and 1 microgram/mL DAPI (1 mg/ml stock in H2O) to 1 ml PBS with 10% FBS.  ",
        "result": {
          "PREPARE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Draw up in a 3 ml syringe and pass through a 0.22-micron syringe filter to sterilize. Re-suspend the cell pellet from the dissociated murine embryonic tissues in 500 microliters blocking buffer and incubate on ice for 5 min.  ",
        "result": {
          "DRAW": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Prepare the antibody mix: Add 10 microgram/ml FcR block to 1 ml PBS with 10% FBS and 10 microliters of each fluorochrome-conjugated antibody (see reagent list): VEcadherin-PECy7, EPCR-PerCP-eFluor710, and CD61-APC. Also prepare a separate antibody mix containing isotype controls antibodies (see reagent list) that will be used to stain a small fraction of AGM cells (~10%) for setting sorting gates.",
        "result": {
          "PREPARE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Draw antibody mix into a 3 ml syringe and pass through a 0.22-micron syringe filter to sterilize. Add 0.5 ml antibody mix to cell pellet in blocking buffer from above. Incubate on ice for at least 20 minutes.  ",
        "result": {
          "DRAW": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Wash the stained cells: Add 9 ml PBS/10% FBS and centrifuge at 300 x g for 5 min, aspirate, and re-suspend the cell pellet in 0.5 ml PBS/10% FBS.  ",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Remove cell clumps by pipetting the cell suspension through a 35-micron cell strainer cap on a 5 ml tube. Place on ice until FACS. ",
        "result": {
          "REMOVE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Perform fluorescence-activated cell sorting (FACS) by first gating on SSC and FSC (using relatively broad gates for FSC-A, as embryonic hemogenic precursors tend to vary in size, and using FSC-W and SSC-W gates to exclude doublets; for sample gating, see6) and gating on live cells as DAPI negative. Gate on VE-Cadherin positive cells and then gate on the subset that is positive for both EPCR and CD61. Use isotype control and fluor-minus one (FMO) samples to set thresholds for gates. Set the sorting machine to the lowest flow rate of 1.0 to minimize shear stress. Sort cells into a 5ml tube containing cold PBS/10% FBS.  ",
        "result": {
          "PERFORM": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "After sorting, centrifuge cells at 300 x g for 10 min, aspirate, and re-suspend the cell pellet in serum-free media (enough for 100 microliters/48-well)",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "e-suspend approximately 1-2 embryo equivalent of sorted cells per 48-well ",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Add 100 microliters of cells to each 48-well (from plate prepared for engineered niche culture), for a total volume of 500 microliters/well ",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Culture cells for 6-7 days in a 37°C tissue culture incubator with 5% C02 before harvesting for phenotypic analysis by flow cytometry and transplantation assays. During culture, colonies of highly motile, semi-adherent, dividing hematopoietic progeny should emerge ，but cells should not be confluent at the time of harvest. ",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "To harvest cells, pipette vigorously and scrape wells with pipette tip to remove all cells. Remove 10% of cells for phenotyping, and the remaining 90% for transplantation or other secondary assays (such as CFU or lymphoid assays in secondary OP9 and OP9-Delta co-cultures8). General phenotyping and transplantation assays are described in our previously published protocol.6 To ensure that all cells are harvested, a small volume of PBS/2% FBS can be used in an additional round of vigorous pipetting and added to the rest of the harvested cells.  ",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  }
]