[
  {
    "title": "",
    "body": [
      {
        "sentence": "Prepare a 2% agarose solution in deionised water. Microwave until agarose has fully melted.",
        "result": {
          "PREPARE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Use a pair of plastic gel plates, consisting of a front and back plate . The back plate contains the buffer reservoir for electrophoresis . It is important that the plates originated from the same cassette, as the plastic connectors break differently when the plates were separated).",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Wash plates with warm water, dry with paper towels.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Join plates together and lay them fl at on an elevated surface such as a pipette tip box",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Using masking tape, seal the bottom slit of the front plate. Fold over the ends of the tape so that it can easily be peeled off prior to electrophoresis",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Similarly, place a second piece of masking tape near the top just under the well numbers",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Flip the gel cassette over and fi rmly pull tape around and tape on opposing plate, such that the two plates are fi rmly held together by the tap. Rub fi ngers fi rmly on the tape.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Wait for agarose solution to cool to approximately 80oC. Take up agarose solution with a 1 ml pipette, avoiding intake of air bubbles. Place the pipette tip on the left side of the gel, and between the two plates close to the gap.Slowly expel the solution in-between the gap. During this procedure do not lift up the cassette, instead it must be kept horizontal at all time. If parts of the gap are still not fi lled with agarose, move along the gap and inject agarose solution where needed.",
        "result": {
          "WAIT": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Keeping the plate in its horizontal position, repeat procedure, but starting on the right side of the cassette.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Keeping the plate in its horizontal position, repeat the same procedure, but starting from the bottom gap.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Place the cassette upright in a peg rack",
        "result": {
          "PLACE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Place medium sized bulldog clips on either side of the cassette",
        "result": {
          "PLACE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Keeping the cassettes in the rack, lift the rack and tilt at a 45o angles Take up hot agarose solution with a 1 ml pipette. Place the pipette tip on right inside edge of the cassette. Allow the agarose solution to fl ow down along the inside edge and to the bottom. Tilt the rack and cassette back to the horizontal position, allowing the agarose solution to continue fl owing along the bottom inside edge of the cassettes. Repeat on the left side. Repeat the process, until there is at least 2-3mm of agarose along the bottom inside edge of the cassettes. This will require approximately 1.5 ml of agarose solution in total). Allow the agarose to set.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Test the sealed cassette for any potential leaks by squeezing water into the cassette using a wash bottle",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Fill up cassette with water. Leave for a few minutes to give time for the sighting of any leaks",
        "result": {
          "FILL": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "After confi rmation that the cassette is note leaking, discard the water by carefully inverting the rack over a sink while holding the cassette in place. Place the rack with the cassette back on the bench. Insert a strip of blotting/fi lter paper between the plates to remove any remaining water. Several pieces of absorbent paper may be needed to remove all water.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "The cassette is ready for pouring the SDS-PAGE gel",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Place the comb into the cassette, between the plates, as far as it can be pushed in. Place the comb slowly between the plates and holding it initially at an angle.",
        "result": {
          "PLACE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Fix the comb to the plates using two large bulldog clips, to hold the comb fi rmly in place",
        "result": {
          "FIX": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Let the acrylamide set, this will take approximately 1.5 hours.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Remove cassette from the rack, remove the bull clips, but Do NOT remove the tape. Wet a paper towel with water and wrap around the cassette, then wrap tightly in plastic wrap. Store in fridge over night to allow for full polymerisation and best results.",
        "result": {
          "REMOVE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Before running the gel, carefully remove the tape covering the slit of the front pate, but do NOT\nremove the second piece of tape holding the plates together. Carefully insert the gel cassette into the electrophoresis unit. Add running buffer to the top reservoir. Add running buffer in the bottom chamber only until the meniscus is approximately 1cm above the slit in the front plate.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "After running the gel, remove the tape and separate the plates. Remove the SDS-PAGE gel for further processing. Remove and discard any excess acrylamide gel and agarose, wash plates in warm water, dry with paper towels, and store until next use",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  }
]