[
  {
    "title": "",
    "body": [
      {
        "sentence": "Screening of crRNAs in mouse P19 cells",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "The crRNA can be purchased ,then ligated into pSLQ8453 (available on Addgene) that has been digested with Esp3 (NEB). Ligation reaction consists of 0.5uM of each oligo duplex, and 1ul of 10x T4 DNA ligase buffer (NEB) and 0.5ul of T4 DNA ligase in a total 10ul reaction incubated at 24C for 10 minutes. Please note that pSLQ8453 expresses a fl uorophore (BFP) and the antibiotic resistance marker to hygromycin. Then, transform ligation reactions into Stellar competent cells, select colonies and verify by Sanger sequencing.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "For CRISPR-activation, the crRNA plasmid should be co-transfected with hyperdCas12a-miniVPR (or a similar transcriptional activator), such as pSLQ10844. For CRISPR-repression, the crRNA plasmid should be co-transfected with hyperdCas12a-KRAB (or a similar transcriptional repressor), such as pSLQ10875.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Culture mouse P19 cells in alpha-MEM with nucleosides (Invitrogen) with 10% FBS.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "For transient transfection, seed P19 cells (in 6-well, 12-well, or 24-well plates) the day before transfection at 2x105 cells/mL to aim for ~60-80% cell confl uency at the time of transfection",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Perform transient transfections with 3 µl of Mirus X2 transfection reagent (Mirus) per µg of total plasmid according to manufacturer protocols.",
        "result": {
          "PERFORM": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "For enrichment of transfected cells using double-selection, the cells can be treated the day after transfection with 500 ug/ml of hygromycin and 2 µg/ml of puromycin",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "At 48 hours after selection (3 days post-transfection), collect the cells for analysis. The level of gene activation or repression and be assayed by qPCR or immunostaining,",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Constructing crRNA arrays for multiplex gene targeting",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "To quantify changes in mRNA levels of target genes by qPCR, isolate RNA from transfected cells with\nQiagen RNeasy plus kit (Qiagen), followed by reverse transcription of 100ng RNA per condition into cDNA using iScript kit (Biorad). Perform quantitative real-time PCR (qRT-PCR) with SYBR master mix (Biorad) per manufacturer’s protocol.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Seed transfected P19 cells into black fl at- bottom 96-well plates 2 days after transfection (thus 1 day after the start of dual-antibiotic selection), keeping them in dual-antibiotic selection media. The next day, aspirate out the media and fi x cells with 4% formaldehyde in 1x PBS for 15 minutes. Then, aspirate out the formaldehyde solution and permeabilize cells with 0.25% Triton X-100 in 1x DPBS for 5 minutes, and apply blocking solution (5% donkey serum in DPBS) for 0.5-1hr. ",
        "result": {
          "SEED": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Then, aspirate out the formaldehyde solution and permeabilize cells with 0.25% Triton X-100 in 1x DPBS for 5 minutes, and apply blocking solution (5% donkey serum in DPBS) for 0.5-1hr. Then apply primary antibodies diluted in blocking solution, and move the plate to 4C overnight after wrapping in aluminum foil.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Next day, wash each well 3x with 1x DBPS and apply secondary antibody Alexa Fluor-conjugated 488nm or 647nm secondary antibodies diluted in blocking solution. Please refer to our antibody list for catalog numbers and dilutions that we used for our proteins of interest. Please note that since our dCas12a plasmid (pSLQ10844) contains mCherry, we did not use any 594nm secondary antibodies. Lastly, each cell was washed 3x with 1x PBS and kept in 1x PBS for imaging.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "For in vivo targeting, the U6-crRNA array and CAG-dCas12a-miniVPR (without mCherry) were combined into a single plasmid using NEBuilder HiFi DNA Assembly (NEB).",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Multiplex gene regulation in the mouse retina by in vivo electroporation",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "For in vivo electroporation experiments, pregnant CD1 mice were purchased (Charles River Laboratories), and maintained under standard conditions until they gave birth. The neonatal mice can be used for electroporation at post-natal day 0-3 (with electroporation effi ciency diminishing around day 4).",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Make a mix of crRNA-array-dCas12a plasmid (e.g., pSLQ10873) and a CAG-GFP plasmid (pSLQ10301, used as marker of electroporation boundary) at ~5:1 ratio while maintaining the total concentration of 2µg/µl. Please only use high-quality DNA preps for in vivo delivery (Qiagen endotoxin- free midiprep or maxiprep kit).",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Briefl y, anesthetize newborn mice on ice and carefully incise the lids open with a sharp 30-gauge needle. Then, inject 0.3 - 0.5 μl of DNA solution (with 0.1% FastGreen dye as an injection tracer) into the subretinal space. Place the head of the injected pup between a 10mm diameter tweezer electrode and apply 5 pulses of 80V, 50ms each, at an interval of 950ms",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Sac the animals at the desired timepoint. It is known that GFP expression is detectable after 3 days1 and up to several months2 post-electroporation. Dissect out the electroporated eye and fi x in 4%paraformaldehyde (PFA) in 1x PBS (pH 7.4) for 2 hours at room temperature. Then, dissect out the retina and equilibrate into a series of sucrose solutions at room temperature (5% sucrose in 1X PBS, 5 min; 15% sucrose in 1X PBS, 15 min; 30% sucrose in 1X PBS, 1 hr; 1:1 mixed solution of OCT and 30% sucrose in PBS, 4°C, overnight), then freeze and store at -80°C.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Using a Leica CM3050S cryostat (Leica Microsystems) or equivalent, prepare 20 μm cryosections and place onto Superfrost microscope slides (Fisherbrand), which can be stored at -80°C.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "For immunostaining of cryosections, wash the slides briefl y in 1X PBS, then incubate in 0.5% Triton in 1X PBS for 20 min, then block for 30 min in blocking solution of 0.1% Triton, 1% bovine serum albumin and 10% donkey serum (Jackson ImmunoResearch Laboratories) in 1X PBS.",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Incubate slides overnight in primary antibodies diluted in block solution, in a humidifi ed chamber at 4°C. Then, after washing in 0.1% Triton in 1X PBS three times, incubate slides in secondary antibodies and DAPI (Sigma-Aldrich; D9542) for 1-2 hr, then wash three times with 0.1% Triton in 1X PBS and mount the slides with Fluoromount-G (Southern Biotechnology Associates).",
        "result": {
          "INCUBATE": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  },
  {
    "title": "",
    "body": [
      {
        "sentence": "Image slides with LSM 710 or LSM 880 Confocal inverted laser scanning microscope, with Plan Apochromat objective with 405, 488, 561 and 633 lasers",
        "result": {
          "ADD": {
            "emit": [],
            "slot": [
              {
                "it's a slot key": "it's a slot value"
              }
            ]
          }
        }
      }
    ]
  }
]